Repository: koevoet/FlashcatUSB
Catalog: langauges/*.resx
Languages: french, german, portuguese, spanish

# fcusb_avrwrite
source: Beginning AVR flash write ({0} bytes)
french: Début AVR d'écriture flash ({0} octets)
german: Beginnend AVR Flash Schreiben ({0} Bytes)
portuguese: Começando AVR Flash write ({0} bytes)
spanish: A partir del AVR Flash de escritura ({0} bytes)

# fcusb_avr_err1
source: Error: The hex file data is larger than the size of the DFU memory
french: Erreur: Les données de fichiers hexadécimaux est plus grande que la taille de la mémoire DFU
german: Fehler: Die Hex-Datei Daten größer ist als die Größe des DFU-Speicher
portuguese: Erro: Os dados do arquivo sextavadas é maior do que o tamanho da memória DFU
spanish: Error: Los datos de archivo hexagonales es más grande que el tamaño de la memoria DFU

# fcusb_avr_err2
source: Erasing the AVR flash memory
french: Effacement de la mémoire flash de AVR
german: Löschen der AVR Flash-Speicher
portuguese: Apagar a memória flash do AVR
spanish: Borrado de la memoria flash de AVR

# fcusb_avr_err3
source: Sending AVR DFU erase command
french: Envoi de commande d'effacement AVR DFU
german: Senden AVR DFU Löschbefehl
portuguese: Enviando AVR comando erase DFU
spanish: El envío de AVR comando de borrado DFU

# fcusb_avr_err4
source: Error: AVR flash erase failed
french: Erreur: AVR éclair effacement a échoué
german: Fehler: AVR Flash Erase gescheitert
portuguese: Erro: AVR erase do flash falhou
spanish: Error: AVR borrado de flash no

# fcusb_avr_err5
source: Error: AVR flash write failed
french: Erreur: AVR éclair d'écriture a échoué
german: Fehler: AVR Flash Schreiben, ist fehlgeschlagen
portuguese: Erro: AVR flash de gravação falhou
spanish: Error: AVR Flash de escritura no

# fcusb_avr_sucess
source: AVR DFU command successful
french: AVR DFU commande réussie
german: AVR DFU Befehl erfolgreich
portuguese: AVR comando DFU com sucesso
spanish: AVR DFU éxito de comandos

# fcusb_avr_writedone
source: AVR flash written successfully
french: AVR éclair écrit avec succès
german: AVR Flash geschrieben erfolgreich
portuguese: AVR Flash escrito com sucesso
spanish: AVR Flash escrito con éxito

# fcusb_avr_writedonegui
source: New AVR firmware programmed (click 'Start Appplication' to begin)
french: Nouveau firmware AVR programmé ('appplication Démarrer' cliquez pour commencer)
german: Neuer AVR Firmware programmiert werden (klicken Sie auf 'Start Anwendungssuche' zu beginnen)
portuguese: Novo firmware AVR programado (clique em 'início da aplicação' para começar)
spanish: Nuevo firmware AVR programado (haga clic en 'Inicio de aplicación' para comenzar)

# fcusb_baseaddress
source: Base address
french: Adresse de base
german: Basisadresse
portuguese: Endereço de base
spanish: Base de la dirección

# fcusb_cancel
source: Cancel
french: Annuler
german: Stornieren
portuguese: Cancelar
spanish: Cancelar

# fcusb_cfi_base
source: Flash base address: {0}
french: Adresse de base de Flash: {0}
german: Flash-Basis-Adresse: {0}
portuguese: Flash endereço base: {0}
spanish: Flash Dirección base: {0}

# fcusb_cfi_bitbus
source: ({0} bit bus)
french: (Bus de bits {0})
portuguese: ({0} ônibus bit)
spanish: ({0} bus bits)

# fcusb_cfi_desc
source: Flash description: {0}
french: Description Flash: {0}
german: Flash-Beschreibung: {0}
portuguese: Descrição do Flash: {0}
spanish: Descripción de Flash: {0}

# fcusb_cfi_erasecomplete
source: CFI erase operation complete!
french: Opération d'effacement FCI compléter!
german: CFI Löschvorgang zu vervollständigen!
portuguese: CFI operação de apagamento completo!
spanish: Operación de borrado de TPI completar!

# fcusb_cfi_erasing
source: Erasing CFI flash (this could take a moment)
french: Effacement CFI flash (ce qui pourrait prendre un moment)
german: Löschen von Flash-CFI (dies könnte einen Moment dauern)
portuguese: Apagar CFI flash (isso pode demorar um pouco)
spanish: Borrado de CFI flash (esto puede tomar un momento)

# fcusb_cfi_err1
source: Failed to open device in JEDEC mode
french: Impossible d'ouvrir le dispositif en mode JEDEC
german: Konnte Gerät in JEDEC-Modus öffnen
portuguese: Falha ao abrir o dispositivo no modo JEDEC
spanish: No se pudo abrir el dispositivo en el modo de JEDEC

# fcusb_cfi_founddev
source: Loaded CFI compatible flash device at: {0}
french: Loaded CFI dispositif de flash compatible à l'adresse: {0}
german: Installiert CFI kompatible Flash-Gerät auf: {0}
portuguese: Loaded CFI dispositivo flash compatível em: {0}
spanish: Cargado CFI dispositivo de memoria flash compatibles en: {0}

# fcusb_cfi_info1
source: Changing parameter for existing part: {0}
french: Modification des paramètres pour une partie existante: {0}
german: Ändern Parameter für bestehende Teil: {0}
portuguese: Mudar de parâmetro para a parte existente: {0}
spanish: Cambio de parámetros para una parte ya existente: {0}

# fcusb_cfi_interface
source: interface
german: Schnittstelle
spanish: interfaz

# fcusb_cfi_pmode
source: Programming mode
french: Le mode de programmation
german: Programmiermodus
portuguese: Modo de programação
spanish: Modo de programación

# fcusb_cfi_unknown
source: (Unknown)
french: (Inconnu)
german: (Unbekannt)
portuguese: (Desconhecido)
spanish: (Desconocido)

# fcusb_common_avrtoprog
source: Choose AVR firmware to program
french: Choisissez AVR firmware au programme
german: Wählen AVR Firmware-Programm
portuguese: Escolha AVR firmware para o programa
spanish: Elegir AVR firmware para el programa

# fcusb_console_save
source: Choose location to save the console log
french: Choisissez l'emplacement pour enregistrer le journal de la console
german: Wählen Sie einen Standort, um die Konsole Protokoll speichern
portuguese: Escolha o local para salvar o log do console
spanish: Elija un lugar para guardar el registro de la consola

# fcusb_dfu_conn
source: Device connected in DFU bootloader mode
french: Le périphérique connecté en mode bootloader DFU
german: Gerät in den DFU-Bootloader-Modus geschaltet
portuguese: Dispositivo conectado em modo DFU bootloader
spanish: El dispositivo conectado en modo bootloader DFU

# fcusb_dfu_ready
source: FlashcatUSB ready for operation in DFU mode
french: FlashcatUSB prêt à fonctionner en mode DFU
german: FlashcatUSB betriebsbereit in den DFU-Modus
portuguese: FlashcatUSB pronto para operação em modo DFU
spanish: FlashcatUSB listo para funcionar en modo DFU

# fcusb_disconnected
source: Disconnected from FlashcatUSB
french: Déconnecté de FlashcatUSB
german: Abgetrennt von FlashcatUSB
portuguese: Desconectado da FlashcatUSB
spanish: Desconectado de FlashcatUSB

# fcusb_err1
source: Error: failed to retrieve board firmware version
french: Erreur: Impossible de récupérer la version du micrologiciel conseil d'administration
german: Fehler beim Firmware-Version abrufen Bord
portuguese: Erro: não foi possível recuperar bordo versão do firmware
spanish: Error: no pudo recuperar la versión firmware de la tarjeta

# fcusb_err2
source: Please upgrade AVR firmware to {0} or newer
french: S'il vous plaît mettre à jour firmware AVR à {0} ou plus récent
german: Bitte aktualisieren AVR-Firmware auf {0} oder neuer
portuguese: Por favor, atualizar o firmware AVR para {0} ou mais recente
spanish: Por favor, actualizar el firmware de AVR a {0} o posterior

# fcusb_err3
source: FlashcatUSB board has outdated firmware
french: FlashcatUSB conseil d'administration a dépassé firmware
german: FlashcatUSB Bord hat Firmware veraltet
portuguese: FlashcatUSB conselho tenha antiquado firmware
spanish: FlashcatUSB junta ha desactualizado firmware

# fcusb_err4
source: FlashcatUSB failed to connect to target board using JTAG
french: FlashcatUSB pas se connecter à la carte cible en utilisant JTAG
german: FlashcatUSB versäumt, eine Verbindung zum Ziel mittels JTAG-Board
portuguese: FlashcatUSB não conseguiu conectar com o destino placa usando JTAG
spanish: FlashcatUSB no pudo conectarse al dirigirse a bordo utilizando JTAG

# fcusb_err5
source: Unable to set value (invalid input)
french: Impossible de définir la valeur (entrée non valide)
german: Kann Wert (ungültige Eingabe) gesetzt
portuguese: Não é possível definir o valor (entrada inválida)
spanish: No se puede establecer el valor (de entrada no válido)

# fcusb_err6
source: Unable to set value (value is larger than one byte)
french: Impossible de définir la valeur (la valeur est supérieure à un octet)
german: Kann Wert (Wert ist größer als ein Byte) gesetzt
portuguese: Não é possível definir valor (o valor é maior do que um byte)
spanish: No se puede establecer el valor (el valor es más grande que un byte)

# fcusb_err7
source: Unable to set value (value is larger than four bytes)
french: Impossible de définir la valeur (valeur est plus grande que quatre octets)
german: Kann Wert (Wert ist größer als vier Bytes) gesetzt
portuguese: Não é possível definir valor (o valor é maior do que quatro bytes)
spanish: No se puede establecer el valor (el valor es mayor que cuatro bytes)

# fcusb_err8
source: Error: file is corrupt or not a AVR Hex file
french: Erreur: le fichier est corrompu ou non d'un fichier Hex AVR
german: Fehler: Datei ist beschädigt oder kein AVR Hex-Datei
portuguese: Erro: arquivo está corrompido ou não um arquivo Hex AVR
spanish: Error: el archivo está dañado o no es un archivo Hex AVR

# fcusb_file
source: File: {0}
french: Fichier: {0}
german: Datei: {0}
portuguese: Arquivo: {0}
spanish: Archivo: {0}

# fcusb_flasherr1
source: Unable to write data to flash device (out of bounds)
french: Impossible d'écrire les données à l'appareil flash (en dehors des limites)
german: Kann Daten auf Flash-Gerät zu schreiben (out of bounds)
portuguese: Não é possível gravar dados para o dispositivo flash (fora dos limites)
spanish: No se puede escribir datos al dispositivo de memoria flash (fuera de límites)

# fcusb_hex_nofile
source: File: no file currently loaded
french: Fichier: pas de fichier actuellement chargé
german: Datei: Nein aktuell geladenen
portuguese: Arquivo: nenhum arquivo atualmente carregado
spanish: Archivo: no hay ningún archivo actualmente cargado

# fcusb_initjtag
source: Initializing EJTAG engine
french: Initialisation du moteur EJTAG
german: Initialisieren EJTAG Motor
portuguese: Inicializando motor EJTAG
spanish: Inicialización del motor EJTAG

# fcusb_jtagsetup
source: JTAG engine setup successfully
french: Configuration moteur JTAG avec succès
german: JTAG-Engine Setup erfolgreich
portuguese: JTAG configuração do motor com sucesso
spanish: JTAG configuración del motor con éxito

# fcusb_jtag_conn
source: Device connected in JTAG mode: {0}
french: Le périphérique connecté en mode JTAG: {0}
german: Geräte im JTAG-Modus geschaltet: {0}
portuguese: Dispositivo conectado no modo de JTAG: {0}
spanish: El dispositivo conectado en el modo JTAG: {0}

# fcusb_jtag_cpureset
source: JTAG: sent processor reset command
french: JTAG: commande de réinitialisation envoyé processeur
german: JTAG: Prozessor geschickt Reset-Befehl
portuguese: JTAG: comando de reset enviado processador
spanish: JTAG: comando enviado reinicio del procesador

# fcusb_jtag_debugon
source: JTAG: Processor entered into debug mode
french: JTAG: Processeur entré en mode de débogage
german: JTAG: Prozessor trat in den Debug-Modus
portuguese: JTAG: Processador entrou em modo de depuração
spanish: JTAG: Procesador entró en modo de depuración

# fcusb_jtag_dma
source: Target device supports DMA mode
french: Périphérique cible prend en charge le mode DMA
german: Zielgerät unterstützt DMA-Modus
portuguese: Dispositivo de destino suporta o modo DMA
spanish: Dispositivo de destino compatible con el modo DMA

# fcusb_jtag_erasecomplete
source: Erase operation complete!
french: Effacer le fonctionnement complet!
german: Löschvorgang abgeschlossen!
portuguese: Apague operação completa!
spanish: Borrar el funcionamiento completo!

# fcusb_jtag_err1
source: Error connecting to target board
french: Erreur de connexion à la carte cible
german: Fehler beim Verbinden mit Brett zielen
portuguese: Erro ao conectar ao alvo bordo
spanish: Error de conexión con destino Junta

# fcusb_jtag_err2
source: Failed to connect to EJTAG device
french: Impossible de se connecter à EJTAG dispositif
german: Es konnte keine Verbindung zum Gerät EJTAG
portuguese: Falha ao conectar ao dispositivo EJTAG
spanish: Error al conectar con el dispositivo EJTAG

# fcusb_jtag_foundat
source: Flash device found at: {0}
french: Dispositif de flash à l'adresse: {0}
german: Flash-Gerät zu Hause: {0}
portuguese: Dispositivo flash encontrada em: {0}
spanish: Dispositivo de memoria flash en: {0}

# fcusb_jtag_foundcfi
source: CFI: Found compatible flash device at: {0}
french: FCI: Trouvé dispositif de flash compatible à l'adresse: {0}
german: CFI: Found kompatible Flash-Gerät auf: {0}
portuguese: CFI: Encontrado dispositivo flash compatível em: {0}
spanish: CFI: Se encuentra en el dispositivo de memoria flash compatibles: {0}

# fcusb_jtag_irlen
source: JTAG: IR length set to {0}
french: JTAG: augmenter la taille IR à {0}
german: JTAG: IR Länge auf {0}
portuguese: JTAG: IR conjunto comprimento para {0}
spanish: JTAG: conjunto de infrarrojos de longitud de {0}

# fcusb_jtag_nodma
source: Target device does not support DMA mode
french: Dispositif cible ne prend pas en charge le mode DMA
german: Zielgerät nicht unterstützt DMA-Modus
portuguese: Dispositivo de destino não suportar o modo DMA
spanish: Dispositivo de destino no admite el modo DMA

# fcusb_jtag_notfound
source: Flash device could not be found
french: Support Flash n'a pu être trouvée
german: Flash-Gerät konnte nicht gefunden werden
portuguese: Dispositivo flash não pôde ser encontrado
spanish: Dispositivo de memoria flash no se pudo encontrar

# fcusb_jtag_praccmode
source: JTAG: Device only supports non-dma (PrAcc) mode and non-pracc firmware is loaded into FlashcatUSB
french: JTAG: appareil prend en charge que non-dma (PrAcc) et le mode non-pracc firmware est chargé dans FlashcatUSB
german: JTAG: Gerät unterstützt nur nicht-DMA (PrAcc)-Modus und nicht-pracc Firmware wird geladen FlashcatUSB
portuguese: JTAG: Dispositivo só oferece suporte a não-dma modo (PrAcc) e não-pracc firmware é carregado em FlashcatUSB
spanish: JTAG: El dispositivo sólo es compatible con la no-DMA (PrAcc) el modo y el firmware no se carga en pracc FlashcatUSB

# fcusb_jtag_ready
source: FlashcatUSB ready for operation in JTAG mode
french: Prêt à fonctionner FlashcatUSB dans JTAG mode de
german: FlashcatUSB betriebsbereit im JTAG-Modus
portuguese: FlashcatUSB pronto para operação em modo JTAG
spanish: Listo para la operación FlashcatUSB en JTAG modo

# fcusb_jtag_searchcfi
source: Searching for CFI compliant Flash device
french: Recherche de la CFIconforme flash dispositif
german: Auf der Suche nach CFI kompatible Flash-Medium
portuguese: Procurando CFI dispositivo flash compatível
spanish: Búsqueda de TPI dispositivo compatible con flash

# fcusb_jtag_searchcfiat
source: Searching for a CFI Flash @ {0}
french: Recherche d'un @ CFI flash {0}
german: Suche nach einem CFI-Flash @ {0}
portuguese: Procurando por um Flash CFI @ {0}
spanish: Búsqueda de un Tribunal de Primera Instancia de Flash @ {0}

# fcusb_jtag_spidetected
source: JTAG: SPI flash detected ({0})
french: JTAG: SPI Flash détectée ({0})
german: JTAG: SPI Flash-Speicher gefunden ({0})
portuguese: JTAG: SPI Flash detectado ({0})
spanish: JTAG: SPI Flash detectado ({0})

# fcusb_jtag_spierasing
source: Erasing entire SPI flash (this could take a moment)
french: Effacement complet SPI flash (ce qui pourrait prendre un moment)
german: Löschen gesamten SPI-Flash (dies könnte einen Moment dauern)
portuguese: Apagar todo SPI flash (isso pode demorar um pouco)
spanish: Borrado de todo el SPI Flash (esto puede tomar un momento)

# fcusb_jtag_spiregret
source: JTAG: SPI register returned {0}
french: JTAG: SPI registre retourné {0}
german: JTAG: SPI-Register zurückgegeben {0}
portuguese: JTAG: SPI registo retornou {0}
spanish: JTAG: SPI registro devuelto {0}

# fcusb_length
source: Length
french: Longueur
german: Länge
portuguese: Comprimento
spanish: Longitud

# fcusb_libusb_ver
source: LibUsbDotNet version: {0}
french: La version LibUsbDotNet: {0}
portuguese: LibUsbDotNet versão: {0}
spanish: Versión LibUsbDotNet: {0}

# fcusb_memdev
source: Memory Device
french: Dispositif de mémoire
german: Speichervorrichtung
portuguese: Dispositivo de Memória
spanish: Memoria del dispositivo

# fcusb_memif_beginread
source: Beginning memory read from {0}
french: Début de mémoire lu à partir de {0}
german: Beginnend Speicher von {0} gelesen
portuguese: Memória começando ler a partir de {0}
spanish: A partir de la memoria leen de {0}

# fcusb_memif_dram_notsup
source: Bulk erase not supported for DRAM devices
french: Effacement en vrac pas pris en charge pour les dispositifs DRAM
german: Bulk-Erase nicht für DRAM-Geräten unterstützt
portuguese: Apagar a massa não suportado por dispositivos de DRAM
spanish: Borrado masivo no es compatible con los dispositivos DRAM

# fcusb_memif_err1
source: MemoryInit: Failed - device parameters failed Init
french: MemoryInit: Impossible - paramètres de l'appareil n'a pas Init
german: MemoryInit: Failed - Geräteparameter gescheitert Init
portuguese: MemoryInit: Falha - os parâmetros do dispositivo falhou Init
spanish: MemoryInit: Error - los parámetros del dispositivo no Init

# fcusb_memif_err2
source: Can not detect SPI flash (API not loaded for current MCU)
french: Impossible de détecter SPI flash (API non chargée pour le courant MCU)
german: Kann nicht erkennen, SPI-Flash (API nicht für aktuelle MCU geladen)
portuguese: Não é possível detectar SPI flash (API não foi carregado para MCU atual)
spanish: No se puede detectar SPI Flash (API no se ha cargado para la corriente MCU)

# fcusb_memif_nopraccsupport
source: MemoryInit: Failed - Unable to connect to PrAcc memory interface (AVR firmware does not support)
french: MemoryInit: Échec - Impossible de se connecter à l'interface de mémoire PrAcc (firmware AVR ne prend pas en charge)
german: MemoryInit: Gescheitert - Keine Verbindung zum PrAcc Speicher-Interface (AVR-Firmware nicht unterstützt) verbinden
portuguese: MemoryInit: Falha - Não foi possível conectar-se a interface de memória PrAcc (firmware AVR não suporta)
spanish: MemoryInit: Error - No se puede conectar a la interfaz de memoria de PrAcc (firmware no es compatible con AVR)

# fcusb_memif_readdone
source: Read operation complete
french: L'opération de lecture complète
german: Lesen Operation abgeschlossen
portuguese: Leia operação completa
spanish: La operación de lectura completo

# fcusb_memif_startaddr
source: Start address: {0} ({1}) Length: {2}
french: Adresse de départ: Longueur {0} ({1}): {2} "
german: Startadresse: {0} ({1}) Länge: {2} "
portuguese: Endereço de partida: Comprimento {0} ({1}): {2}
spanish: Dirección de inicio: Duración {0} ({1}): {2} "

# fcusb_memif_verify
source: Verifing written data at {0}
french: Verifing données écrites à {0}
german: Verifing geschriebenen Daten unter {0}
portuguese: Verificar, os dados gravados em {0}
spanish: Verificando los datos escritos en {0}

# fcusb_memif_verifyerr1
source: Error: Flash verify read an incorrect number of bytes
french: Erreur: Flash vérifier lire un nombre incorrect d'octets
german: Fehler: Flash überprüfen las eine falsche Anzahl von Bytes
portuguese: Erro: Flash verificar ler um número incorreto de bytes
spanish: Error: Flash comprobar leer un número incorrecto de bytes

# fcusb_memif_verifyerr2
source: Address {0}: wrote {1} and read {2} ({3} mismatches)
french: Adresse {0}: {1} a écrit et de lecture {2} ({3} décalages)
german: Adresse {0}: {1} schrieb und las {2} ({3} Mismatches)
portuguese: Endereço {0}: {1} escreveu e de leitura {2} ({3} incompatibilidades)
spanish: Dirección {0}: {1} escribió y leer {2} ({3} desajustes)

# fcusb_memif_verifyfailed
source: Error: data verification at {0} failed!
french: Erreur: la vérification des données à {0} a échoué!
german: Fehler: Datenüberprüfung bei {0} ist fehlgeschlagen!
portuguese: Erro: verificação de dados em {0} falhou!
spanish: Error: la verificación de datos en {0}!

# fcusb_memif_verifyokay
source: Data verification was successful
french: La vérification des données a été un succès
german: Die Verifizierung der Daten erfolgreich war
portuguese: Verificação de dados foi bem-sucedida
spanish: Verificación de datos se ha realizado correctamente

# fcusb_memif_writeaddr
source: Writing address {0} with {1} bytes ({2})
french: Rédaction adresse {0} {1} avec octets ({2})
german: Schreiben von Adresse {0} mit {1} Bytes ({2})
portuguese: Escrevendo endereço {0} com {1} bytes ({2})
spanish: Escribir la dirección {0} con {1} bytes ({2})

# fcusb_memif_writecomplete
source: Write Flash operation complete!
french: L'opération d'écriture flash complet!
german: Schreiben Sie den Flash-Vorgang abgeschlossen!
portuguese: A operação de escrita de Flash completo!
spanish: Escriba el funcionamiento de Flash completo!

# fcusb_memif_writedone
source: Write operation complete, {0} bytes written.
french: L'opération d'écriture terminée, {0} octets écrite.
german: Schreib-Operation abgeschlossen, geschrieben {0} Bytes.
portuguese: Escreva operação completa, {0} bytes por escrito.
spanish: Escribir operación completa, {0} bytes por escrito.

# fcusb_memif_writespeed
source: {0} bytes written in {1} seconds, {2} Bytes/s
french: {0} octets écrits dans {1} secondes, {2} octets par seconde
german: {0} Bytes in {1} Sekunden geschrieben, {2} Bytes / s
portuguese: {0} bytes escritos em {1} segundos, {2} Bytes/s
spanish: {0} bytes escritos en el segundo {1}, {2} Bytes/s

# fcusb_memif_write_err1
source: Unable to write data (device is read-only)
french: Impossible d'écrire des données (dispositif est en lecture seule)
german: Daten können nicht schreiben (Gerät ist read-only)
portuguese: Não é possível gravar dados (dispositivo é somente leitura)
spanish: No se puede escribir los datos (el dispositivo es de sólo lectura)

# fcusb_mem_address
source: Address
french: Adresse
german: Adresse
portuguese: Endereço
spanish: Dirección

# fcusb_mem_cancelled
source: User cancelled write operation
french: L'utilisateur a annulé l'opération d'écriture
german: Benutzer abgebrochen Schreib-Operation
portuguese: O usuário cancelou a operação de escrita
spanish: El usuario ha cancelado la operación de escritura

# fcusb_mem_choosefile
source: Choose file to write into {0}
french: Choisir un fichier à écrire dans {0}
german: Wählen Sie Datei zu schreiben, in {0}
portuguese: Escolha o arquivo para gravar em {0}
spanish: Seleccione el archivo para escribir en {0}

# fcusb_mem_err1
source: Error, file does not exist or contains no data
french: Erreur, le fichier n'existe pas ou ne contient pas de données
german: Fehler, keine Datei nicht vorhanden oder enthält keine Daten
portuguese: De erro, arquivo não existe ou não contém dados
spanish: Error, el archivo no existe o no contiene datos

# fcusb_mem_err2
source: Error while trying to read data
french: Erreur lors de la tentative de lecture de données
german: Fehler beim Versuch, Daten zu lesen
portuguese: Erro ao tentar ler os dados
spanish: Error al intentar leer los datos

# fcusb_mem_filechosen
source: File chosen, writting into {0}
french: Fichier choisi, en écriture {0}
german: Gewählt, in writting Datei {0}
portuguese: Arquivo escolhido, escrevendo em {0}
spanish: Archivo elegido, escribiendo en {0}
