Repository: koevoet/FlashcatUSB
Catalog: langauges/*.resx
Languages: french, german, portuguese, spanish

# fcusb_filesave_type
source: Choose hard drive location and output data format
french: Choisissez l'emplacement du disque dur et le format des données de sortie
german: Wählen Sie Speicherort auf der Festplatte und Output-Daten-Format
portuguese: Escolha o local do disco rígido e formato de dados de saída
spanish: Seleccione la ubicación del disco duro y formato de salida de datos

# fcusb_xferspeed
source: Transfer speed
french: Vitesse
german: Geschwindigkeit
portuguese: Acelerar
spanish: Acelerar

# fcusb_dfu_file_default
source: File: no file currently loaded
french: Fichier: pas de fichier a été chargé
german: Datei: Nein geladen wurde
portuguese: Arquivo: nenhum arquivo foi carregado
spanish: Archivo: no hay ningún archivo se ha cargado

# fcusb_dfu_loadfile
source: Load File
french: Chargez le fichier
german: Datei laden
portuguese: Carregar arquivo
spanish: Cargar archivo

# fcusb_dfu_progfile
source: Program
french: Programmez
german: Programm die Daten
portuguese: Programa
spanish: Programa

# fcusb_dfu_startprog
source: Start application
french: Appplication Démarrer
german: Start Anwendungssuche
portuguese: início da aplicação
spanish: Inicio de aplicación

# fcusb_stop
source: STOP
german: HALT
portuguese: PARAR
