Repository: koevoet/FlashcatUSB
Catalog: langauges/*.resx
Languages: french, german, portuguese, spanish

# fcusb_mem_opened_bin
source: Opened file for writing: {0} (binary hex format), total file size: {1} bytes
french: Fichier ouvert en écriture: {0} (format hexadécimal binaire), la taille totale du fichier: {1} octets
german: Eröffnet Datei zum Schreiben: {0} (binäre Hex-Format), Gesamtgröße der Datei: {1} Bytes
portuguese: Arquivo aberto para escrita: {0} (formato hexadecimal binário), o tamanho total do arquivo: {1} bytes
spanish: Archivo abierto para escritura: {0} (formato binario hexadecimal), el tamaño total del archivo: {1} bytes

# fcusb_mem_opened_intel
source: Opened file for writing: {0} (Intel hex format), total file size: {1} bytes
french: Fichier ouvert en écriture: {0} (format hexadécimal Intel), la taille totale du fichier: {1} octets
german: Eröffnet Datei zum Schreiben: {0} (Intel Hex-Format), Gesamtgröße der Datei: {1} Bytes
portuguese: Arquivo aberto para escrita: {0} (Intel formato hexadecimal), o tamanho total do arquivo: {1} bytes
spanish: Archivo abierto para escritura: {0} (formato Intel hexadecimal), el tamaño total del archivo: {1} bytes

# fcusb_mem_readcanceled
source: Read operation canceled
french: Lire opération annulée
german: Lesen Vorgang abgebrochen
portuguese: Leia operação cancelada
spanish: La operación de lectura cancelada

# fcusb_mem_readcomplete
source: Read complete, please choose location and format type
french: Lire compléter, s'il vous plaît choisir le type d'emplacement et le format
german: Lesen Sie die vollständige, wählen Sie bitte Ort und Format-Typ
portuguese: Leia completo, por favor, escolha o tipo de local e formato
spanish: Lea completa, por favor elija el tipo de ubicación y el formato

# fcusb_mem_readfrom
source: Select range to read from {0}
french: Sélectionnez la plage à lire à partir de {0}
german: Wählen Bereich von {0} gelesen
portuguese: Selecione a faixa de ler a partir de {0}
spanish: Seleccione el rango de lectura de {0}

# fcusb_mem_readstart
source: Beginning memory read operation
french: Début de mémoire opération de lecture
german: Beginnend Speicher Lese-Operation
portuguese: Começando memória operação de leitura
spanish: A partir de la memoria la operación de lectura

# fcusb_mem_selectwriterange
source: Select range to write data to {0}
french: Sélectionnez la plage d'écrire des données {0}
german: Wählen Sie Auswahl, um Daten zu schreiben {0}
portuguese: Selecione a faixa para gravar dados em {0}
spanish: Seleccione el rango para escribir datos en {0}

# fcusb_mem_usercanceledread
source: User cancelled read operation
french: L'utilisateur a annulé l'opération de lecture
german: Benutzer abgebrochen Lesevorgang
portuguese: O usuário cancelou a operação de leitura
spanish: El usuario ha cancelado la operación de lectura

# fcusb_mem_usercanwrite
source: User canceled. No data written to {0}
french: L'utilisateur a annulé. Pas de données écrites à {0}
german: Benutzer abgebrochen. Es liegen keine Daten geschrieben, um {0}
portuguese: Usuário cancelado. Não há dados escritos para {0}
spanish: El usuario ha cancelado. No hay datos escritos en {0}

# fcusb_mem_writecanceled
source: Flash write operation canceled
french: Flash plus d'écriture opération annulée
german: Flash-Schreib-Operation abgesagt
portuguese: Flash operação de gravação cancelada
spanish: Flash operación de escritura cancelada

# fcusb_mem_writecomplete
source: Write operation complete: {0} bytes written.
french: L'opération d'écriture complète: {0} octets écrite.
german: Schreib-Operation abgeschlossen: {0} Bytes geschrieben.
portuguese: Escreva operação completa: {0} bytes por escrito.
spanish: Escribir operación completa: {0} bytes por escrito.

# fcusb_mem_writestart
source: Beginning memory write operation
french: Début opération d'écriture de mémoire
german: Zum Anfang Speicher-Schreib-Operation
portuguese: Operação de gravação começando de memória
spanish: A partir de la memoria operación de escritura

# fcusb_mem_writing
source: Writing file {0} into {1} ({2} bytes to write)
french: L'écriture du fichier {0} en {1} ({2} octets à écrire)
german: Schreiben von Datei {0} in {1} ({2} zu schreibenden Bytes)
portuguese: Escrevendo arquivo {0} em {1} ({2} bytes para escrever)
spanish: Escribir el archivo {0} en {1} ({2} bytes a escribir)

# fcusb_menu_console
source: Console
german: Konsole
spanish: Consola

# fcusb_menu_cscript
source: Current script
french: Script courant
german: Aktuelle Skript
portuguese: Script actual
spanish: Script actual

# fcusb_menu_detectdevice
source: Detect device
french: Détecter dispositif
german: Entdecken Gerät
portuguese: Detectar dispositivo
spanish: Detectar el dispositivo

# fcusb_menu_exit
source: Exit
french: Sortie
german: Ausgang
portuguese: Sair
spanish: Salida

# fcusb_menu_language
source: Language
french: Langue
german: Sprache
portuguese: Linguagem
spanish: Lengua

# fcusb_menu_loadscript
source: Load script
french: Script de chargement
german: Ladeskript
portuguese: Carregar script
spanish: Cargar secuencia de comandos

# fcusb_menu_main
source: Main
french: Principal
portuguese: Principal
spanish: Principal

# fcusb_menu_script
source: Script
french: Scénario
german: Skript
spanish: Guión

# fcusb_menu_settings
source: Settings
french: Paramètres
german: Einstellungen
portuguese: Configurações
spanish: Configuración

# fcusb_menu_spisettings
source: SPI Settings
french: Paramètres SPI
german: SPI-Einstellungen
portuguese: SPI Configurações
spanish: Configuración de SPI

# fcusb_menu_spi_auto
source: Use automatic settings
french: Utiliser les paramètres automatiques
german: Automatische Einstellungen
portuguese: Usar configurações automáticas
spanish: Utilice la configuración automática

# fcusb_menu_spi_bitorder
source: Bit Order
french: Commandez bits
german: Bit-Reihenfolge
portuguese: Ordem Bit
spanish: Bit Orden

# fcusb_menu_spi_chiperase
source: Chip Erase
french: Effacer Chip
german: Chip Löschen
portuguese: Apagar Chip
spanish: Chip de Borrar

# fcusb_menu_spi_chipsize
source: Chip Size
french: Taille de la puce
german: Chip Größe
portuguese: Tamanho Chip
spanish: Chip de Tamaño

# fcusb_menu_spi_clodiv
source: Clock Divider
french: Diviseur d'horloge
german: Taktteiler
portuguese: Divisor Relógio
spanish: Divisor de reloj

# fcusb_menu_spi_devcmds
source: SPI device commands
french: Commandes de périphériques SPI
german: SPI Gerät Befehle
portuguese: Dispositivo comandos SPI
spanish: SPI comandos de dispositivos

# fcusb_menu_spi_enwrstatus
source: Enable Write Status
french: Activer Ecrire statut
portuguese: Activar escrever Estado
spanish: Habilitar Escribe Estado

# fcusb_menu_spi_erasesize
source: Erase Size
french: Taille Effacer
german: Erase Größe
portuguese: Tamanho Erase
spanish: Borrar Tamaño

# fcusb_menu_spi_info
source: Use the values commonly found in the device's datasheet
french: Utilisez les valeurs communément trouvés dans la fiche technique de l'appareil
german: Verwenden Sie die Werte häufig in den Geräte-Datenblatt gefunden
portuguese: Use os valores comumente encontrados na folha de dados do dispositivo
spanish: Utilice los valores que se encuentran comúnmente en la hoja de datos del dispositivo

# fcusb_menu_spi_pmode
source: Program Mode
french: Mode Programme
german: Programm-Modus
portuguese: Modo de Programação
spanish: Modo de programación

# fcusb_menu_spi_pp
source: Page Program
french: Programme des pages
german: Seite Programm
portuguese: Programa página
spanish: Página del Programa

# fcusb_menu_spi_read
source: Read
french: Lire
german: Lesen
portuguese: Ler
spanish: Leer

# fcusb_menu_spi_rstatus
source: Read Status
french: Lire l'état
german: Status lesen
portuguese: Leitura de Estado
spanish: Leer estado

# fcusb_menu_spi_serase
source: Sector Erase
french: Effacer secteur
german: Sektor Löschen
portuguese: Apagar Sector
spanish: Sector Borrar

# fcusb_menu_spi_spimode
source: SPI Mode
german: SPI-Modus
portuguese: Modo SPI
spanish: Modo SPI

# fcusb_menu_spi_usesettings
source: Use these settings
french: Utilisez ces paramètres
german: Manuelle Einstellungen
portuguese: Usar essas configurações
spanish: Utilice estos ajustes

# fcusb_menu_spi_usewren
source: Use 'Enable Write Status'
french: Utilisez 'Activer Ecrire État
german: Verwenden Sie 'Schreib-Status ermöglichen'
portuguese: Usar 'Ativar gravação Status'
spanish: Use 'Activar Escribe Estado'

# fcusb_menu_spi_we
source: Write Enable
french: Ecrire Activer
german: Schreiben Sie Enable
portuguese: Escreva Habilitar
spanish: Escribir Habilitar

# fcusb_menu_spi_wstatus
source: Write Status
french: Ecrire statut
german: Schreib-Status
portuguese: Escreva Estado
spanish: Escribe Estado

# fcusb_menu_status
source: Status
french: Statut
portuguese: Estado
spanish: Estado

# fcusb_menu_unloadscript
source: Unload script
french: Décharger le script
german: Entladeskript
portuguese: Descarregar script
spanish: Descargue secuencia de comandos

# fcusb_nonvol_dataread
source: Data successfully read and parsed
french: Les données correctement lus et analysés
german: Daten erfolgreich gelesen und analysiert
portuguese: Dados sucesso ler e analisado
spanish: Los datos leídos satisfactoriamente y se analiza

# fcusb_nonvol_err1
source: Error: No CFG area Found!
french: Erreur: Aucune zone CFG trouvé!
german: Fehler: Keine CFG Bereich gefunden!
portuguese: Erro: Nenhuma área CFG encontrado!
spanish: Error: No se encuentra la zona CFG!

# fcusb_nonvol_err2
source: Error loading Non-Vol data
french: Erreur lors du chargement de données non-vol
german: Fehler beim Laden Non-Vol Daten
portuguese: Erro ao carregar Non-Vol dados
spanish: Error al cargar los datos para non-vol

# fcusb_nonvol_notfound
source: (Not found)
french: (Pas trouvé)
german: (Nicht gefunden)
portuguese: (Não encontrado)
spanish: (No se ha encontrado)

# fcusb_nonvol_readingnonvol
source: Reading Non-Vol configuration data
french: La lecture des données de configuration non-vol
german: Reading Non-Vol-Konfigurationsdaten
portuguese: Leitura de dados Non-Vol configuração
spanish: Lectura para Non-Vol datos de configuración

# fcusb_nonvol_writing
source: Writing Non-Vol configuration to Flash
french: Rédaction non-vol de configuration au format Flash
german: Writing Non-Band-Konfiguration zu Flash
portuguese: Escrever Non-Vol configuração para o Flash
spanish: Escribir para no vol configuración para Flash

# fcusb_nonvol_wrote
source: Done. Non-Vol config updated
french: Terminé. Non-vol config à jour
german: Fertig. Non-Vol Config aktualisiert
portuguese: Feito. Non-Vol configuração atualizada
spanish: Hecho. Non-Vol. configuración actualizada

# fcusb_nand_conn
source: Device connected in NAND over SPI mode
french: Le périphérique connecté dans la NAND sur le mode SPI
german: Geräte in NAND über SPI-Modus geschaltet
portuguese: Dispositivo conectado em NAND em modo SPI
spanish: El dispositivo conectado en la NAND en modo SPI

# fcusb_nand_ready
source: FlashcatUSB ready for operation in NAND mode
french: FlashcatUSB prêt à fonctionner en mode NON-ET
german: FlashcatUSB betriebsbereit in NAND-Modus
portuguese: FlashcatUSB pronto para operação no modo NAND
spanish: FlashcatUSB listo para funcionar en modo NAND

# fcusb_newavrfw
source: Programming new AVR firmware
french: Nouvelle programmation AVR firmware
german: Programmierung neuer AVR-Firmware
portuguese: Programação novo AVR firmware
spanish: Nueva programación AVR firmware

# fcusb_noflash
source: (no flash detected)
french: (Pas de flash détecté)
german: (Kein Blitz erkannt)
portuguese: (Sem flash foi detectado)
spanish: (Sin flash detectado)

# fcusb_okbutton
source: OK
spanish: Aceptar

# fcusb_range
source: Range:
french: Gamme:
german: Reichweite:
portuguese: Faixa:
spanish: Rango:

# fcusb_Read
source: Read
french: Lire
german: Lesen
portuguese: Ler
spanish: Leer

# fcusb_running
source: Running on: {0}
french: Fonctionnant sur: {0}
german: Laufen auf: {0}
portuguese: Correndo em: {0}
spanish: Correr en: {0}

# fcusb_script_check
source: Checking for a device specific script to automatically load
french: Vérification d'un script dispositif spécifique pour charger automatiquement
german: Suchen nach einem bestimmten Gerät Skript automatisch zu laden
portuguese: Verificação de um script de dispositivo específico para carregar automaticamente
spanish: Comprobación de un guión de un dispositivo específico para cargar automáticamente

# fcusb_script_loaded
source: Loaded script {0} successfully
french: Script chargé {0} avec succès
german: Loaded skript {0} erfolgreich
portuguese: Script carregado {0} com sucesso
spanish: Script cargado {0} con éxito

# fcusb_script_loading
source: Loading device specific script: {0}
french: Chargement de script dispositif spécifique: {0}
german: Ladevorrichtung spezifische Skript: {0}
portuguese: Carregando script de dispositivo específico: {0}
spanish: Carga de secuencia de comandos de un dispositivo específico: {0}

# fcusb_script_none
source: No script files available
french: Pas de fichiers de script disponibles
german: Keine Skript-Dateien verfügbar
portuguese: Não há arquivos de script disponíveis
spanish: No hay archivos de comandos disponibles

# fcusb_script_notexist
source: Can not load script (file does not exist)
french: Impossible de charger le script (fichier n'existe pas)
german: Skript kann nicht geladen werden (Datei nicht vorhanden ist)
portuguese: Não é possível carregar script (arquivo não existe)
spanish: No se puede cargar script (archivo no existe)

# fcusb_script_open
source: Select FlashcatUSB script file to open
french: Sélectionnez le fichier de script pour ouvrir FlashcatUSB
german: Wählen FlashcatUSB Skript-Datei zu öffnen
portuguese: Selecione FlashcatUSB arquivo de script para abrir
spanish: Seleccione el archivo FlashcatUSB secuencia de comandos para abrir

# fcusb_script_unload
source: The script {0} has been unloaded
french: Le script {0} a été déchargé
german: Das Skript {0} wurde entladen
portuguese: O script {0} foi descarregado
spanish: El guión {0} se ha descargado

# fcusb_spi_connflash
source: Connected to Flash
french: Connecté à Flash
german: Verbunden mit Flash
portuguese: Conectado para o Flash
spanish: Conectado a Flash

# fcusb_spi_email
source: For read write support email contact@embeddedcomputers.net with JEDEC ID
french: Pour lire écrire contact@embeddedcomputers.net support par email avec JEDEC ID
german: Für Lese-Schreib-Support per E-Mail contact@embeddedcomputers.net mit JEDEC-ID
portuguese: Para ler escrever contact@embeddedcomputers.net e-mail de apoio com JEDEC ID
spanish: Para lectura y escritura contact@embeddedcomputers.net soporte por correo electrónico con JEDEC ID

# fcusb_spi_erasecomplete
source: Flash erase complete in {0} seconds
french: Flash erase compléter dans {0} secondes
german: Flash Erase in {0} Sekunden abgeschlossen
portuguese: Apagar flash completo em {0} segundos
spanish: Flash Erase completar en {0} segundos

# fcusb_spi_erasingbulk
source: Erasing entire flash device, total size: {0} bytes (this may take a moment)
french: Effacement périphérique flash ensemble, la taille totale: {0} octets (cela peut prendre un moment)
german: Löschen ganzer Flash-Gerät, Gesamtgröße: {0} Bytes (dies kann einen Moment dauern)
portuguese: Apagar dispositivo flash inteiro, tamanho total: {0} bytes (isto pode demorar um pouco)
spanish: Borrado de todo el dispositivo de memoria flash, el tamaño total: {0} bytes (esto puede tardar un momento)

# fcusb_spi_err1
source: FlashcatUSB connected in SPI mode but no Flash detected
french: FlashcatUSB connecté en mode SPI, mais pas de Flash détectée
german: FlashcatUSB im SPI-Modus angeschlossen, aber kein Flash erkannt
portuguese: FlashcatUSB conectado no modo de SPI mas nenhuma o Flash detectado
spanish: FlashcatUSB conectado en modo SPI, pero no detectaron flash

# fcusb_spi_err2
source: FlashcatUSB detected SPI device but its not currently supported
french: FlashcatUSB détecté dispositif SPI, mais ce n'est pas actuellement pris en charge
german: FlashcatUSB erkannt SPI Devices, sondern seine Zeit noch nicht unterstützt
portuguese: FlashcatUSB detectado dispositivo SPI mas não é actualmente suportado
spanish: FlashcatUSB detectado dispositivo SPI pero no es compatible en la actualidad

# fcusb_spi_err3
source: SPI device size must be at least one megabit
french: La taille du périphérique SPI doit être d'au moins un mégabit
german: SPI Gerätegröße muss mindestens ein Megabit sein
portuguese: SPI tamanho do dispositivo deve ser pelo menos um megabit
spanish: Tamaño del SPI dispositivo debe ser al menos un megabit

# fcusb_spi_err4
source: SPI device size must be a multiple of a megabit
french: La taille du périphérique SPI doit être un multiple d'un mégabit
german: SPI-Gerät muss ein Vielfaches von einem Megabit sein
portuguese: SPI tamanho do dispositivo deve ser um múltiplo de um megabit
spanish: Tamaño del SPI dispositivo debe ser un múltiplo de un megabit

# fcusb_spi_err5
source: Unable to connect to compatible SPI device
french: Impossible de se connecter à un appareil compatible SPI
german: Keine Verbindung zum kompatiblen Gerät verbinden SPI
portuguese: Não foi possível conectar ao dispositivo compatível SPI
spanish: No se puede conectar al dispositivo compatible con SPI

# fcusb_spi_flashdetected
source: Flash detected: {0} ({1} bytes)
french: Flash détecté: {0} ({1} octets)
german: Flash-Speicher gefunden: {0} ({1} Bytes)
portuguese: Flash detectado: {0} ({1} bytes)
spanish: Detectado Flash para: {0} ({1} bytes)

# fcusb_spi_modenotsupported
source: Error setting SPI mode, mode not supported: {0}
french: Erreur de paramétrage de SPI, mode non pris en charge: {0}
german: Fehler beim Festlegen des SPI-Modus, Modus nicht unterstützt: {0}
portuguese: Erro configuração SPI, o modo não é suportado: {0}
spanish: Error de configuración de SPI, el modo no es compatible: {0}

# fcusb_spi_modesetauto
source: SPI mode set to auto configure
french: SPI mode de réglage automatique de configurer
german: SPI-Modus auf auto konfigurieren
portuguese: SPI modo definido para auto configurar
spanish: SPI de modo ajustado en auto configurar

# fcusb_spi_modesetto
source: SPI mode set to {0}
french: SPI mode réglé sur {0}
german: SPI-Modus auf {0}
portuguese: SPI modo definido para {0}
spanish: SPI de modo ajustado en {0}

# fcusb_spi_openinmode
source: Opening device in SPI Mode
french: Dispositif d'ouverture dans SPI mode
german: Öffnungsvorrichtung im SPI-Modus
portuguese: Abrindo dispositivo em modo SPI
spanish: La apertura del dispositivo en modo SPI

# fcusb_spi_progmode
source: Programming mode: SPI (high-speed)
french: Programmation en mode: SPI (haute vitesse)
german: Programmiermodus: SPI (schnell-Modus)
portuguese: Programação modo: SPI (alta velocidade)
spanish: Modo de programación: SPI (alta velocidad)

# fcusb_spi_ready
source: FlashcatUSB ready for operation in SPI mode
french: FlashcatUSB prête pour exploitation dans les SPI mode de
german: FlashcatUSB betriebsbereit im SPI-Modus
portuguese: FlashcatUSB pronto para operação em modo SPI
spanish: FlashcatUSB listo para funcionar en modo SPI

# fcusb_spi_scanning
source: Scanning for spi flash
french: Numérisation pour Flash SPI
german: Scannen für SPI-Flash
portuguese: Exploração para SPI Flash
spanish: La búsqueda de los SPI Flash

# fcusb_spi_usingcustom
source: Using custom settings from SPI Settings page
french: Utilisation des paramètres personnalisés à partir de la page Paramètres SPI
german: Mit benutzerdefinierten Einstellungen von SPI Seite Einstellungen
portuguese: Usando configurações personalizadas do SPI página Configurações
spanish: Utilización de los ajustes personalizados de la página Configuración de SPI

# fcusb_spi_ver
source: Device connected in SPI mode, firmware version: {0}
french: Le périphérique connecté au mode SPI, la version de firmware: {0}
german: Geräte im SPI-Modus, Firmware-Version verbunden sind: {0}
portuguese: Dispositivo conectado em modo SPI, versão do firmware: {0}
spanish: El dispositivo conectado en modo SPI, la versión del firmware: {0}

# fcusb_status_connected
source: FlashcatUSB status: Connected
french: État FlashcatUSB: Connecté
german: FlashcatUSB Status: Verbunden
portuguese: FlashcatUSB estado: Conectado
spanish: Estado de FlashcatUSB: Conectado

# fcusb_status_disconnect
source: FlashcatUSB status: Disconnected
french: État FlashcatUSB: Déconnecté
german: FlashcatUSB Status: Getrennt
portuguese: FlashcatUSB estado: Desconectado
spanish: Estado de FlashcatUSB: Desconectado

# fcusb_waitingforusb
source: Software waiting for device to be connected via USB
french: Logiciel d'attente pour que l'appareil soit connecté via USB
german: Software warten, bis das Gerät über USB angeschlossen werden
portuguese: Software de esperar pelo dispositivo a ser conectado via USB
spanish: Software de espera para el dispositivo que se conecta a través de USB

# fcusb_welcome
source: Welcome to FlashcatUSB interfacing software, build: {0}
french: Bienvenue dans le logiciel d'interfaçage FlashcatUSB, construire: {0}
german: Willkommen bei FlashcatUSB Schnittstellen-Software, bauen: {0}
portuguese: Bem-vindo ao FlashcatUSB software de interface, construir: {0}
spanish: Bienvenido al software de interfaz FlashcatUSB, construir: {0}

# fcusb_welcome_status
source: Welcome to FlashcatUSB!
french: Bienvenue à FlashcatUSB!
german: Willkommen bei FlashcatUSB!
portuguese: Bem-vindo ao FlashcatUSB!
spanish: Bienvenido a FlashcatUSB!

# fcusb_Write
source: Write
french: Écrire
german: Schreiben
portuguese: Escrever
spanish: Escribir

# cnts_avrver
source: Board firmware version
french: Conseil la version du micrologiciel
german: Foren-Firmware-Version
portuguese: Quadro versão do firmware
spanish: Consejo de la versión de firmware

# cnts_device
source: Connected to device
french: Connecté à un appareil
german: Verbunden mit Gerät
portuguese: Conectado a um dispositivo
spanish: Conectado a dispositivo

# cnts_flashname
source: Flash memory name
french: Nom de la mémoire Flash
german: Flash-Speicher-Namen
portuguese: Flash nome da memória
spanish: Nombre de la memoria flash

# cnts_flashsize
source: Flash memory size
french: Taille de la mémoire flash
german: Flash-Speichergröße
portuguese: Tamanho da memória flash
spanish: Tamaño de la memoria flash

# cnts_flashtype
source: Flash memory type
french: Type de mémoire Flash
german: Flash-Speicher-Typ
portuguese: Tipo Flash de memória
spanish: Tipo de memoria flash

# cnts_mode
source: Device mode
french: Mode de l'appareil
german: Geräte-Modus
portuguese: Modo de dispositivo
spanish: Dispositivo de modo de

# cnts_script
source: Active script
french: Script actif
german: Aktiv-Skript
portuguese: Script activo
spanish: Secuencia de comandos activa

# fcusb_menu_verify
source: Verify programming
french: Vérifiez la programmation
german: Überprüfen Sie die Programmierung
portuguese: Verifique a programação
spanish: Verifique la programación

# fcusb_filesave_canceled
source: User canceled. No data has been saved
french: L'utilisateur a annulé. Aucune donnée n'a été enregistrée
german: Benutzer abgebrochen. Es wurden keine Daten gespeichert
portuguese: Usuário cancelado. Nenhum dado foi salvo
spanish: El usuario ha cancelado. No hay datos se ha guardado

# fcusb_filesave_sucess
source: {0} successfully saved to disk
french: {0} sauvegardé avec succès sur le disque
german: {0} erfolgreich auf der Festplatte gespeichert
portuguese: {0} salvo com sucesso para o disco
spanish: {0} guardado con éxito en el disco

# fcusb_filesave_tohex
source: Converted data read into Intel hex format for saving
french: Données converties dans un format de lecture Intel hex pour sauver
german: Konvertierten Daten in Intel hex Format zum Speichern lesen
portuguese: Dados convertidos lidos em formato hexadecimal Intel para salvar
spanish: Leer los datos convertidos a formato hex de Intel para el ahorro
